{
  "es_ES": [
  {  
    "id" : 1,
    "title" : "GifApp",
    "imgCard" : "/gr8nvgkv2mkucby7f1tf.webp", 
    "imgBanner": "/mlyhal9ji72hbl5qk0jz.webp",
    "description" : ["Es un buscador de gifs animados, usando la api de Giphy, se puede usar el buscador para introducir los términos de lo que deseas buscar, además en la entrada de la app, sale una relación de categorías fijas y que van conectado con la api para sacar gifs relacionados con estas categorías.",

    "La aplicación está creada usando React y su fin era la de practicar con la conexión a APIs externas y cómo manipular los resultados dentro de mi Frontend.",

    "También se usa Sass para manejar el CSS de la aplicación, ya que una de las intenciones de este proyecto era mejorar en su manejo, por lo demás es una aplicación sencilla, pero que me resultó interesante a la hora de crearla."],
    "descShort" : "GifApp busca Gifs usando la API de Gyphy",
    "techList" : ["HTML", "CSS", "JavaScript", "React", "Sass"],
    "url" : "/portfolio/gifapp",
    "urlDemo" : "https://caraje.github.io/gifsApp/",
    "urlGithub" : "https://github.com/Caraje/gifsApp",
    "images": [] 
  },
  {  
    "id" : 2,
    "title" : "Emparejados",
    "imgCard" : "/lzjcidjflbjqovpdtpdi.webp", 
    "imgBanner": "/xzw5lpexugndylqjug0e.webp",
    "description" : ["Una versión del popular juego de cartas “Memory”, donde el jugador deberá encontrar parejas dentro de un número determinado de cartas, una vez que el jugador revela todas las parejas disponibles el juego termina.",

    "Está creado usando React con la intención de practicar la comunicación entre componentes y el uso del “state”, además este proyecto supuso mi primer contacto con “SASS” del cual también tenía interés de comprobar su funcionamiento.",

    "El juego además cuenta con sistema de puntuación para el jugador en base de aciertos y fallos durante la partida, quedando reflejados los puntos totales, los intentos que ha tenido para completarlo y la cantidad de fallos."],
    "descShort" : "El mítico juego de buscar parejas entre múltiples cartas",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Sass"],
    "url": "/portfolio/emparejados",
    "urlDemo" : "https://caraje.github.io/Emparejados/",
    "urlGithub" : "https://github.com/Caraje/Emparejados",
    "images": [] 
  },
  {  
    "id" : 3,
    "title" : "BlackJack",
    "imgCard" : "/upo8icygvbkctgkkwblx.webp", 
    "imgBanner": "/twsirahvubo3ihkmthtc.webp",
    "description" : ["Una versión del juego de cartas BlackJack, donde el jugador tiene que ir pidiendo cartas en este caso a la máquina, con la finalidad de sumar 21 puntos, siempre sin pasarse, posteriormente la CPU, en su turno procede a hacer lo mismo y aquel que iguale o se quede más cerca de los 21 puntos sin pasarse gana la ronda.",

    "Fue quizá mi primera práctica personal, realizada únicamente con HTML, CSS y JavaScript, por lo que es un poco especial para mi pese a su simpleza de cara al código, sin embargo me permitió explorar el uso de JavaScript y el uso de DOM.",

    "Su diseño es ultra simple ya que no era la prioridad del proyecto, que era el uso de JavaScript, el proyecto en su momento supuso algún quebradero de cabeza, pero fue muy satisfactorio cuando lo termine de programar."],
    "descShort" : "Juego de cartas contra la máquina, donde el primero en llegar sin pasarse a 21 gana",
    "techList" : ["HTML", "CSS", "Javascript"],
    "url": "/portfolio/blackjack",
    "urlDemo" : "https://blackjack-caraje.netlify.app/",
    "urlGithub" : "https://github.com/Caraje/BlackJack",
    "images": [] 
  },
  {  
    "id" : 4,
    "title" : "TodoApp",
    "imgCard" : "/nqpemceost1j3ftviup2.webp", 
    "imgBanner": "/ug0sjmoolkvhh5qmliaf.webp",
    "description" : ["Uno de mis primeros proyectos de aprendizaje que realicé cuando empecé en el mundo de la programación, la idea era realizar un proyecto únicamente haciendo uso de JavaScript, sin usar otras tecnologías adicionales.",

    "Es una aplicación de tareas que permite al usuario crear nuevas tareas, marcarlas y desmarcar las completadas, así como poder eliminarlas las completadas.",

    "Lo importante de este proyecto era el manejo del DOM, y en especial aprender a hacer el uso del “LocalStorage”, además trate de hacer uso del CSS para ampliar mis conocimientos y habituarme a su uso"],
    "descShort" : "App para organizar tareas del día a día",
    "techList" : ["HTML", "CSS", "Javascript"],
    "url": "/portfolio/todoapp",
    "urlDemo" : "ttps://caraje.github.io/Todo-Js-Vanilla/",
    "urlGithub" : "https://github.com/Caraje/Todo-Js-Vanilla",
    "images": [] 
  },
  {  
    "id" : 5,
    "title" : "CarlosAjenjo(V1)",
    "imgCard" : "/hxw3wiei0zebavhagqri.webp", 
    "imgBanner": "/j5j9anjoaemf6zwjppsg.webp",
    "description" : ["Es el proyecto de la que fue mi primera web personal, antes de esta que está disponible actualmente, fue creada con React como forma de practicar con esta tecnología.",

    "Fue un proyecto sencillo pero que me permitió aprender mucho, por eso me gusta conservarla, más por motivos sentimentales que prácticos.",

    "En este proyecto me centré también en el apartado visual, ya que era importante para mi web personal, sin embargo decidí cambiarla porque no representaba mis conocimientos actuales y podría realizar un mejor trabajo con mi experiencia actual."],
    "descShort" : "Mi primera Web creada con React",
    "techList" : ["HTML", "CSS", "Javascript", "React"],
    "url": "/portfolio/CarlosAjenjo(V1)",
    "urlDemo" : "https://carlosajenjo-com.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/carlosajenjo.com",
    "images": [] 
  },
  {  
    "id" : 6,
    "title" : "Calendario",
    "imgCard" : "/yzodgnswbc9ei2jtdqbv.webp", 
    "imgBanner": "/g1ih6hzujqh5ippvx8sp.webp",
    "description" : ["La aplicación es un calendario donde varios usuarios pueden ir anotando diferentes tareas de algún proyecto en el que puedan estar trabajando juntos, es quizás el proyecto más elaborado que he publicado en esta web.",

    "Está creada usando React, y además gestiona el uso de varios usuarios, así como los permisos de estos, también hace uso del context.",

    "Además esta aplicación no solo tiene programado el Front, sino que también se le realizó su propio BackEnd y quizás lo más importante de este proyecto además de usar context y creación y gestión de usuarios múltiples, es que fue mi primer contacto con Testing en React."],
    "descShort" : "Una App para la organización diaria, donde añadir, modificar o borrar tareas de uno o de varios usuarios",
    "techList" : ["HTML", "CSS", "Javascript", "React"],
    "url": "/portfolio/calendario",
    "urlDemo" : "https://calendar-app-back.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/CalenadarApp",
    "images": [] 
  },
  {  
    "id" : 7,
    "title" : "Pokemon",
    "imgCard" : "/gcodwhundnricapavuyu.webp", 
    "imgBanner": "/fuy23xnksszumlsttp82.webp",
    "description" : [ "Es una aplicación simple para explorar el uso de Next.js, es un catálogo de diferentes Pokemons que se extraen de una API. y se muestra el listado completo con un par de datos extraídos de la misma API.",

    "La aplicación además permite guardar un listado de Pokemons favoritos y poder consultarlos cuando quieras, aunque la intención de la aplicación es la de aprender el manejo de Next.js y del “Static Props” y “static Paths”"],
    "descShort" : "App conectada a una API de Pokemon, para tener una lista de los Pokemon disponibles",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Sass", "Next-js"],
    "url": "/portfolio/pokemon",
    "urlDemo" : "https://pokemon-app-indol.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/pokemonApp",
    "images": [] 
  },
  {  
    "id" : 8,
    "title" : "Dados y Pixeles",
    "imgCard" : "/nsxtws4j4ezyyksmhuf9.webp", 
    "imgBanner": "/pvp2j81yxy8rdhq7fplp.webp",
    "description" : ["Es una web centrada en series, juegos de mesa, cine y videojuegos, que nació como un proyecto personal de amigos, un lugar donde poder escribir y hablar sobre algunos de sus hobbies habituales.",

    "Se trata de una versión preliminar del proyecto, mientras se prepara un proyecto más complejo y con más características, sin embargo, para el inicio del proyecto la prioridad era poder subir los artículos de forma fácil y rápida, por eso opte por usar Next.js y subir los artículos desde archivos Markdown.",

    "El proyecto esta creado desde cero sin usar paquetes de terceros y mantenerlo lo más sencillo posible, para más adelante hacerlo evolucionar y añadirle características más complejas tanto para los miembros que colaboran con el proyecto como los usuarios que lo visitan."],
    "descShort" : "La web oficial de un proyecto personal, tipo blog para hablar de cine, series, videojuegos y juegos de mesa",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Next-js"],
    "url": "/portfolio/dados-y-pixeles",
    "urlDemo" : "https://www.dadosypixeles.es",
    "urlGithub" : "https://github.com/Caraje/dadosypixeles",
    "images": [] 
  },
  {  
    "id" : 9,
    "title" : "Answer for Developers",
    "imgCard" : "/o1cjrkakkhe1nusoo2dz.webp", 
    "imgBanner": "/rxmmd7ugwesfxz0cjzmp.webp",
    "description" : ["Este proyecto fue creado para el Hackathon de Enero 2023 organizado por Midudev. Fue desarrollado con la tecnología de Inteligencia Artificial de Co:here.",

    "La propuesta consiste en que los usuarios puedan hacer preguntas sobre desarrollo web a la aplicación y recibir respuestas generadas por la IA de Co:here, basadas en su aprendizaje. Cuanto más detallada sea la pregunta, más clara será la respuesta generada."],
    "descShort" : "Una app que usa 'Inteligencia Artificial' que se usó para participar en una hackathon",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Vite"],
    "url": "/portfolio/answer-for-developers",
    "urlDemo" : "https://answer-for-developers.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/Anwser-for-Developers",
    "images": [] 
  }
],
"en_EN": [
  {  
    "id" : 1,
    "title" : "GifApp",
    "imgCard" : "/gr8nvgkv2mkucby7f1tf.webp", 
    "imgBanner": "/mlyhal9ji72hbl5qk0jz.webp",
    "description" : ["It is a search engine for animated gifs, using the Giphy api, you can use the search engine to enter the terms of what you want to search, also at the entrance of the app, there is a list of fixed categories and that are connected with the api to get gifs related to these categories.",

    "The application is created using React and its purpose was to practice with the connection to external APIs and how to manipulate the results within my Frontend.", "The application is created using React and its purpose was to practice with the connection to external APIs and how to manipulate the results within my Frontend.",

    "Sass is also used to handle the CSS of the application, as one of the intentions of this project was to get better at handling it, otherwise it's a simple application, but one that I found interesting when creating it."],
    "descShort" : "GifApp searches for Gifs using Gyphy API",
    "techList" : ["HTML", "CSS", "JavaScript", "React", "Sass"],
    "url" : "/portfolio/gifapp",
    "urlDemo" : "https://caraje.github.io/gifsApp/",
    "urlGithub" : "https://github.com/Caraje/gifsApp",
    "images": [] 
  },
  {  
    "id" : 2,
    "title" : "Emparejados",
    "imgCard" : "/lzjcidjflbjqovpdtpdi.webp", 
    "imgBanner": "/xzw5lpexugndylqjug0e.webp",
    "description" : ["A version of the popular card game 'Memory', where the player must find pairs within a given number of cards, once the player reveals all the available pairs the game ends.", "It is created using React with the intention of practicing communication between components and the use of 'state'",

    "It is created using React with the intention of practicing the communication between components and the use of 'state', also this project was my first contact with 'SASS' of which I was also interested in testing its operation.",

    "The game also has a scoring system for the player based on successes and failures during the game, reflecting the total points, the attempts he has had to complete it and the number of failures"],
    "descShort" : "The mythical game of searching for pairs among multiple cards",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Sass"],
    "url": "/portfolio/emparejados",
    "urlDemo" : "https://caraje.github.io/Emparejados/",
    "urlGithub" : "https://github.com/Caraje/Emparejados",
    "images": [] 
  },
  {  
    "id" : 3,
    "title" : "BlackJack",
    "imgCard" : "/upo8icygvbkctgkkwblx.webp", 
    "imgBanner": "/twsirahvubo3ihkmthtc.webp",
    "description" : ["A version of the card game BlackJack, where the player has to go asking cards in this case to the machine, in order to add 21 points, always without going over, then the CPU, in turn proceeds to do the same and the one who equals or stays closer to 21 points without going over wins the round.",

    "It was perhaps my first personal practice, done only with HTML, CSS and JavaScript, so it's a bit special to me despite its simplicity in the face of code, however it allowed me to explore the use of JavaScript and the use of DOM.",

    "Its design is ultra simple as it was not the priority of the project, which was the use of JavaScript, the project at the time involved some headache, but it was very satisfying when I finished programming it."],
    "descShort" : "Card game against the machine, where the first to reach 21 without going over wins.",
    "techList" : ["HTML", "CSS", "Javascript"],
    "url": "/portfolio/blackjack",
    "urlDemo" : "https://blackjack-caraje.netlify.app/",
    "urlGithub" : "https://github.com/Caraje/BlackJack",
    "images": [] 
  },
  {  
    "id" : 4,
    "title" : "TodoApp",
    "imgCard" : "/nqpemceost1j3ftviup2.webp", 
    "imgBanner": "/ug0sjmoolkvhh5qmliaf.webp",
    "description" : ["One of my first learning projects I did when I started in the programming world, the idea was to make a project only using JavaScript, without using other additional technologies.",

    "It is a task application that allows the user to create new tasks, mark and unmark the completed ones, as well as being able to delete the completed ones.",

    "The important thing about this project was the handling of the DOM, and especially learning how to make use of the 'LocalStorage', I also tried to make use of CSS to expand my knowledge and get used to its use."],
    "descShort" : "App to organize daily tasks",
    "techList" : ["HTML", "CSS", "Javascript"],
    "url": "/portfolio/todoapp",
    "urlDemo" : "ttps://caraje.github.io/Todo-Js-Vanilla/",
    "urlGithub" : "https://github.com/Caraje/Todo-Js-Vanilla",
    "images": [] 
  },
  {  
    "id" : 5,
    "title" : "CarlosAjenjo(V1)",
    "imgCard" : "/hxw3wiei0zebavhagqri.webp", 
    "imgBanner": "/j5j9anjoaemf6zwjppsg.webp",
    "description" : ["It is the project of what was my first personal website, before this one that is currently available, it was created with React as a way to practice with this technology.",

    "It was a simple project but one that allowed me to learn a lot, that's why I like to keep it, more for sentimental reasons than practical ones.",

    "In this project I also focused on the visual section, as it was important for my personal website, however I decided to change it because it didn't represent my current knowledge and I could do a better job with my current experience."],
    "descShort" : "My first website created with React",
    "techList" : ["HTML", "CSS", "Javascript", "React"],
    "url": "/portfolio/CarlosAjenjo(V1)",
    "urlDemo" : "https://carlosajenjo-com.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/carlosajenjo.com",
    "images": [] 
  },
  {  
    "id" : 6,
    "title" : "Calendario",
    "imgCard" : "/yzodgnswbc9ei2jtdqbv.webp", 
    "imgBanner": "/g1ih6hzujqh5ippvx8sp.webp",
    "description" : ["The application is a calendar where several users can write down different tasks of a project in which they can be working together, it is perhaps the most elaborate project I have published on this website",

    "It is created using React, and it also manages the use of several users, as well as the permissions of these, it also makes use of context.",

    "In addition this application not only has programmed the Front, but also made its own BackEnd and perhaps the most important thing about this project besides using context and creation and management of multiple users, is that it was my first contact with Testing in React."],
    "descShort" : "An App for daily organization, where you can add, modify or delete tasks for one or several users.",
    "techList" : ["HTML", "CSS", "Javascript", "React"],
    "url": "/portfolio/calendario",
    "urlDemo" : "https://calendar-app-back.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/CalenadarApp",
    "images": [] 
  },
  {  
    "id" : 7,
    "title" : "Pokemon",
    "imgCard" : "/gcodwhundnricapavuyu.webp", 
    "imgBanner": "/fuy23xnksszumlsttp82.webp",
    "description" : [ "It is a simple application to explore the use of Next.js, it is a catalog of different Pokemons that are extracted from an API. and it shows the complete list with a couple of data extracted from the same API.",

    "The application also allows you to save a list of favorite Pokemons and be able to consult them whenever you want, although the intention of the application is to learn the handling of Next.js and the 'Static Props' and 'static Paths'."],
    "descShort" : "App connected to a Pokemon API, to have a list of available Pokemon.",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Sass", "Next-js"],
    "url": "/portfolio/pokemon",
    "urlDemo" : "https://pokemon-app-indol.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/pokemonApp",
    "images": [] 
  },
  {  
    "id" : 8,
    "title" : "Dados y Pixeles",
    "imgCard" : "/nsxtws4j4ezyyksmhuf9.webp", 
    "imgBanner": "/pvp2j81yxy8rdhq7fplp.webp",
    "description" : ["It is a website focused on series, board games, movies and video games, which was born as a personal project of friends, a place where they can write and talk about some of their usual hobbies.",

    "This is a preliminary version of the project, while preparing a more complex project with more features, however, for the beginning of the project the priority was to be able to upload the articles easily and quickly, so I opted to use Next.js and upload the articles from Markdown files.",

    "The project is created from scratch without using third party packages and keep it as simple as possible, to later make it evolve and add more complex features for both the members who collaborate with the project and the users who visit it."],
    "descShort" : "The official website of a personal blog-like project to talk about movies, series, video games and board games.",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Next-js"],
    "url": "/portfolio/dados-y-pixeles",
    "urlDemo" : "https://www.dadosypixeles.es",
    "urlGithub" : "https://github.com/Caraje/dadosypixeles",
    "images": [] 
  },
  {  
    "id" : 9,
    "title" : "Answer for Developers",
    "imgCard" : "/o1cjrkakkhe1nusoo2dz.webp", 
    "imgBanner": "/rxmmd7ugwesfxz0cjzmp.webp",
    "description" : ["This project was created for the January 2023 Hackathon organized by Midudev. It was developed with Co:here's AI technology.",

    "The proposal is that users can ask web development questions to the application and receive answers generated by Co:here's AI based on its learning. The more detailed the question, the clearer the generated answer will be."],
    "descShort" : "An app using 'Artificial Intelligence' used to participate in a hackathon",
    "techList" : ["HTML", "CSS", "Javascript", "React", "Vite"],
    "url": "/portfolio/answer-for-developers",
    "urlDemo" : "https://answer-for-developers.vercel.app/",
    "urlGithub" : "https://github.com/Caraje/Anwser-for-Developers",
    "images": [] 
  }
]
}


