{
  "es_ES": {
    "home": {
      "aboutMeText": [
        "¡Hola! Bienvenido a mi sitio web personal, donde busco mi primera oportunidad laboral como desarrollador web. A pesar de no tener experiencia profesional previa en este campo, he aumentado mi experiencia mediante la realización de proyectos personales, lo que me ha brindado la capacidad de enfrentarme por mi cuenta a retos y problemas para encontrar soluciones óptimas. También he trabajado con diferentes lenguajes y herramientas para mejorar mis habilidades en el desarrollo web.",
        "Aunque mi experiencia laboral anterior no estuvo relacionada con la programación, mi compromiso y responsabilidad hacia mi trabajo siempre han sido la base de mi éxito en el pasado. He tenido la oportunidad de asumir puestos de responsabilidad, liderar equipos y gestionar proyectos desde el inicio hasta la finalización con excelentes resultados.",
        "Si estás buscando un desarrollador web comprometido, apasionado y con ganas de aprender, no dudes en ponerte en contacto conmigo. ¡Estoy ansioso por conocer nuevas oportunidades para crecer y evolucionar como desarrollador web!"
      ],
      "footer": "Gracias por tu visita, si te gusta no dudes en tomarla como inspiración, aunque se agradece una mencion si lo haces."
    }
  },
  "en_EN": {
    "home": {
      "aboutMeText": [
        "Hello! Welcome to my personal website, where I am seeking my first job opportunity as a web developer. Despite having no previous professional experience in this field, I have increased my expertise by completing personal projects, which have provided me with the ability to independently face challenges and problems to find optimal solutions. I have also worked with various languages and tools to improve my skills in web development.",
        "Although my previous work experience was not related to programming, my commitment and responsibility towards my work have always been the foundation of my success in the past. I have had the opportunity to assume positions of responsibility, lead teams, and manage projects from start to finish with excellent results.",
        "If you are looking for a committed, passionate web developer with a desire to learn, please don't hesitate to contact me. I am eager to discover new opportunities to grow and evolve as a web developer!"
      ],
      "footer": "Thank you for your visit, if you like it, feel free to take it as inspiration, although a mention is appreciated if you do so"
    }
  }
}